// problems.js

// Set the date when this batch of problems should start
// Use the format "YYYY-MM-DD" (Year-Month-Day)
// const referenceDate = "2026-07-08"; 
const referenceDate = "2026-07-13"; 

const mathProblems = [
    /*
    1111111111
    {
        question: "Поставете всички знаци: ＋, －, × и : между цифрите \\(88888 = 99\\), за да получите вярно равенство. Запишете полученото равенство.",
        image: "", 
        hint: "Как ще направим така че и двете страни да са четни или и двете страни да са нечетни? (Когато равенството е изпълнено те задължително трябва да са такива, защото нечетно число не може да бъде равно на четно число, разбира се.)"
    },
    {
        question: "Сборът на всички двуцифрени числа с две различни цифри, избрани от цифрите 2, 3 и \\(х\\), е  по-голям от 299. Пресметнете 2.3.\\(х\\).", 
        image: "", 
        hint: "Колко са тези числа? Опитай да ги запишеш и после да представиш сбора им в десетичен запис. Използвай съдружителното и разпределителното свойство на умножението."
    },
    {
        question: "Колко са трицифрените четни числа, цифрата на стотиците на които е сбор на другите две цифри?",
        image: "",
        hint: "Трябва ни някаква система, за да сме сигурни, че сме преброили всички такива числа. Такава система би могла да бъде например: колко и какви възможности имаме за цифра на единиците; каква може да бъде цифрата на десетиците във всеки от тези случай; какво остава за цифрата на стотиците? (Едно многоцифрено число е четно единствено и само, ако неговата цифра на единиците е четна!)" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Старият часовник на дядо ми изостава с 15 секунди в час. Сверих часовника в 8:00 часа. Колко ще показва след едно денонощие?",
        image: "",
        hint: "Какво значи един часовник да изостава? Какво ще показва часовникът след един час? А след 4?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Кои са възможностите за цифра на единиците на числото \\(х\\), ако цифрата на единиците на числото, равно на \\(11.1 + 15.5 + 16. 6 + 19. 9 + 12.x\\), e 3?",
        image: "",
        hint: "Не ни е казано колко цифри има числото \\(x\\). Цифрата на десетиците, стотиците, хилядите на \\(x\\) влияе ли на това каква ще е цифрата на единиците на числото от условието? Защо?" // Leaving this empty will hide the hint button for today
    },*/
    {
        question: "Сини и червени балони се продават на една и съща цена. Петър купил 6 сини балона, а Мария – 10 червени. Мария е заплатила с 2 лева повече от Петър. Колко е заплатил Петър за закупените от него балони?",
        image: "",
        hint: "Има ли значение цветът на балоните? Защо?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Върху две от страните на триъгълник със страни 3 см, 4 см и 5 см външно са построени квадрат и равностранен триъгълник. Обиколката на получената фигура в сантиметри е четното число \\(х\\). Намерете всички възможни стойности на \\(х\\).",
        image: "345.png",
        hint: "Задължително си нарисувай сам чертеж(и) и го (ги) съпостави с условието (кой триъгълник кой е, кое е квадратът)." // Leaving this empty will hide the hint button for today
    },
    {
        question: "В 3-ти А клас 6 ученици ядат сладолед всеки ден, 8 ученици ядат сладолед през ден, а останалите не ядат сладолед изобщо. Вчера 12 ученици от 3-ти А са яли сладолед. Колко ученици ще ядат сладолед днес?",
        image: "",
        hint: "Кои от учениците яли днес няма да ядат утре? А кои от тези не яли днес ще ядат утре?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Златар изписва табелки с букви. Еднаквите букви златарят изработва за едно и също време, а различните букви за различно време. За табелите „ДОМ МОДА“ и „ВХОД“ са му нужни общо 50 минути, за табелата „ДАМОХОД В“ са му нужни 35 минути. За колко време златарят ще напише табелка с думата „ВАХОД“.",
        image: "",
        hint: "Не ни е нужно да намираме за колко време се изработва всяка буква поотделно. Редът на буквите в думата също не влияе на общото време на изработка. Предвид това, колко време би отнело на златаря да изработи табела с надпис „ДОМ“? Как чрез този резултат можем да решим задачата?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Тази вечер трима приятели си говорят. Глория казала: „Аз винаги изговарям по-малко от шест думи“, Алекс казал: „Всички изречения с повече от шест думи са лъжливи“, Мартин добавил: „Поне един от нас днес лъже“ Определете кой лъже и кой говори истината?",
        image: "",
        hint: "Глория може ли да казва истината? А Алекс? Какво означава това за Мартин?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "На опашка за сладолед стоят Петър, Васил, Олга и Мария. Знаем,че момичетата не са едно до друго. Васил е точно след Олга, а Мария е веднага след Петър. В какъв ред е опашката за сладолед?",
        image: "",
        hint: "Направи си таблица с имена и места и я попълни прилежно." // Leaving this empty will hide the hint button for today
    },
    {
        question: "Шофьор забелязал километричен знак, на който пишело 2-цифрено число от две различни цифри. Пътувал малко и на друг километричен знак забелязал число със същите цифри, но в друг ред. Намерете най-малкото възможно разстояние, което може да е изминал шофьора. Обосновете отговора си.",
        image: "",
        hint: "Запиши изминатия път в десетичен запис и помисли при какво условие полученият израз ще стане възможно най-малък." // Leaving this empty will hide the hint button for today
    }

];
