// problems.js

// Set the date when this batch of problems should start
// Use the format "YYYY-MM-DD" (Year-Month-Day)
// const referenceDate = "2026-07-08"; 
//const referenceDate = "2026-07-13"; 
//const referenceDate = "2026-07-19"; 
//const referenceDate = "2026-08-09";
const referenceDate = "2026-09-30";

const mathProblems = [
    /*
    1111111111
    {
        question: "Поставете всички знаци: ＋, －, × и : между цифрите \\(88888 = 99\\), за да получите вярно равенство. Запишете полученото равенство.",
        image: "", 
        hint: "Как ще направим така че и двете страни да са четни или и двете страни да са нечетни? (Когато равенството е изпълнено те задължително трябва да са такива, защото нечетно число не може да бъде равно на четно число, разбира се.)"
    },
    {
        question: "Сборът на всички двуцифрени числа с две различни цифри, избрани от цифрите 2, 3 и \\(х\\), е  по-голям от 299. Пресметнете 2.3.\\(х\\).", 
        image: "", 
        hint: "Колко са тези числа? Опитай да ги запишеш и после да представиш сбора им в десетичен запис. Използвай съдружителното и разпределителното свойство на умножението."
    },
    {
        question: "Колко са трицифрените четни числа, цифрата на стотиците на които е сбор на другите две цифри?",
        image: "",
        hint: "Трябва ни някаква система, за да сме сигурни, че сме преброили всички такива числа. Такава система би могла да бъде например: колко и какви възможности имаме за цифра на единиците; каква може да бъде цифрата на десетиците във всеки от тези случай; какво остава за цифрата на стотиците? (Едно многоцифрено число е четно единствено и само, ако неговата цифра на единиците е четна!)" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Старият часовник на дядо ми изостава с 15 секунди в час. Сверих часовника в 8:00 часа. Колко ще показва след едно денонощие?",
        image: "",
        hint: "Какво значи един часовник да изостава? Какво ще показва часовникът след един час? А след 4?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Кои са възможностите за цифра на единиците на числото \\(х\\), ако цифрата на единиците на числото, равно на \\(11.1 + 15.5 + 16. 6 + 19. 9 + 12.x\\), e 3?",
        image: "",
        hint: "Не ни е казано колко цифри има числото \\(x\\). Цифрата на десетиците, стотиците, хилядите на \\(x\\) влияе ли на това каква ще е цифрата на единиците на числото от условието? Защо?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Сини и червени балони се продават на една и съща цена. Петър купил 6 сини балона, а Мария – 10 червени. Мария е заплатила с 2 лева повече от Петър. Колко е заплатил Петър за закупените от него балони?",
        image: "",
        hint: "Има ли значение цветът на балоните? Защо?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Върху две от страните на триъгълник със страни 3 см, 4 см и 5 см външно са построени квадрат и равностранен триъгълник. Обиколката на получената фигура в сантиметри е четното число \\(х\\). Намерете всички възможни стойности на \\(х\\).",
        image: "345.png",
        hint: "Задължително си нарисувай сам чертеж(и) и го (ги) съпостави с условието (кой триъгълник кой е, кое е квадратът)." // Leaving this empty will hide the hint button for today
    },
    {
        question: "В 3-ти А клас 6 ученици ядат сладолед всеки ден, 8 ученици ядат сладолед през ден, а останалите не ядат сладолед изобщо. Вчера 12 ученици от 3-ти А са яли сладолед. Колко ученици ще ядат сладолед днес?",
        image: "",
        hint: "Кои от учениците яли днес няма да ядат утре? А кои от тези не яли днес ще ядат утре?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Златар изписва табелки с букви. Еднаквите букви златарят изработва за едно и също време, а различните букви за различно време. За табелите „ДОМ МОДА“ и „ВХОД“ са му нужни общо 50 минути, за табелата „ДАМОХОД В“ са му нужни 35 минути. За колко време златарят ще напише табелка с думата „ВАХОД“.",
        image: "",
        hint: "Не ни е нужно да намираме за колко време се изработва всяка буква поотделно. Редът на буквите в думата също не влияе на общото време на изработка. Предвид това, колко време би отнело на златаря да изработи табела с надпис „ДОМ“? Как чрез този резултат можем да решим задачата?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Тази вечер трима приятели си говорят. Глория казала: „Аз винаги изговарям по-малко от шест думи“, Алекс казал: „Всички изречения с повече от шест думи са лъжливи“, Мартин добавил: „Поне един от нас днес лъже“ Определете кой лъже и кой говори истината?",
        image: "",
        hint: "Глория може ли да казва истината? А Алекс? Какво означава това за Мартин?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "На опашка за сладолед стоят Петър, Васил, Олга и Мария. Знаем,че момичетата не са едно до друго. Васил е точно след Олга, а Мария е веднага след Петър. В какъв ред е опашката за сладолед?",
        image: "",
        hint: "Направи си таблица с имена и места и я попълни прилежно." // Leaving this empty will hide the hint button for today
    }, 2222222222222
    {
        question: "Шофьор забелязал километричен знак, на който пишело 2-цифрено число от две различни цифри. Пътувал малко и на друг километричен знак забелязал число със същите цифри, но в друг ред. Намерете най-малкото възможно разстояние, което може да е изминал шофьора. Обосновете отговора си.",
        image: "",
        hint: "Запиши изминатия път в десетичен запис и помисли при какво условие полученият израз ще стане възможно най-малък." // Leaving this empty will hide the hint button for today
    },
    {
        question: "От цифрите 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 са съставени 5 двуцифрени числа (всяка цифра е използвана не повече от веднъж). Какъв е най-големият възможен сбор на тези числа? А най-малкият?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Кое е най-малкото естествено число, чието произведение на цифрите е трицифрено?",
        image: "",
        hint: "Може ли това число да бъде двуцифрено? Колко цифри най-малко трябва да има? Тук трябва да бъдем много внимателни, когато съставяме търсеното число. Търсим най-малкото естествено число с произведение на цифрите, което е трицифрено число, а не естествено число, чието произведение на цифрите е възможно най-малко трицифрено число. Помисли каква е разликата между последните две неща. Съставянето на числото става най-лесно цифра по цифра по метода на изключването. Помисли от коя цифра трябва да започнем." // Leaving this empty will hide the hint button for today
    },
    {
        question: "Кое двуцифрено число нараства със 72 при размяна на цифрите си? Опитайте се да покажете, че това число е единствено.",
        image: "",
        hint: "Запиши условието буквено и всяко число в десетичен запис." // Leaving this empty will hide the hint button for today
    },33333333333333333333
    {
        question: "Четно двуцифрено число е събрано с нечетно трицифрено число. Колко са възможните стойности на сбора?",
        image: "",
        hint: "Кои са най-малката и най-голямата възможни стойности? Има ли стойности между тях, които не са възможни? Колко на брой са те?" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Колко възможни екипи можем да съставим от 6 вида фланелки, 4 вида гащета и 1 вид чорапи?",
        image: "",
        hint: "Само припомням: когато за съставянето на крайния резултат е нужна поредица от избори, броят на възможностите се получава като умножим броя на възможностите при всеки избор!" // Leaving this empty will hide the hint button for today
    },
    {
        question: "В редица са посадени 4 дървета. Всяко от тях е круша, слива или кайсия. колко са всички възможни такива редици?",
        image: "",
        hint: "Вчерашната подсказка отново важи и е достатъчна за днешната задача. Въпреки това си припомни кои и колко са n - нещата тук и m - местата. Каква формула важи тук (Редът има ли значение? Позволено ли е повторение?)" // Leaving this empty will hide the hint button for today
    },
    {
        question: "Колко двуцифрени числа имат две различни цифри?",
        image: "",
        hint: "От общия брой на двуцифрените числа извади броя на тези сред тях, които са с еднакви цифри." // Leaving this empty will hide the hint button for today
    },
    {
        question: "Колко от първите 999 естествени числа съдържат цифрата 2, но не съдържат цифрата 3?",
        image: "",
        hint: "От общия брой на тези от първите 999 естествени числа, които съдържат цифрата 2, извади броя на тези, които съдържат както 2, така и 3. (Броим умно, а не хамалски!)" // Leaving this empty will hide the hint button for today
    },444444444444

    {
        question: "При решаване на една и съща задача трима ученици получили следните отговори: 358, 257 и 468. Всеки от тях е получил вярно само една от цифрите на верния отговор. (Един е получил само цифрата на единиците, друг – само цифрата на десетиците, третият – само цифрата на стотиците.) Намерете верния отговор, ако той е трицифрено число. ",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Във всяка клетка на таблица с 2 реда и 3 колонки е написано число. Митко събрал числата в първия ред и числата в първата колона, а след това събрал двата сбора и получил 67. Силвия събрала числата във втория ред и числата във втората колона, а след това събрала двата сбора и получила 26. Ако сборът на всички числа в таблицата е 55, намерете сбора на числата в третата колона.",
        image: "1008.png",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Бонбон, дъвка и фъстък тежат общо 9 грама, а 4 бонбона, 3 дъвки и 2 фъстъка тежат общо 28 грама. Колко грама тежат 1 бонбон, 2 дъвки и 3 фъстъка? ",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Няколко цветенца имат по 11 листенца, а няколко – по 8 листенца. Общо листенцата са 100. Колко са цветенцата?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Кодът на охранителна система се състои от три цифри. Колко най-голям брой различни опити трябва да се направи, за да се открие кодът на системата?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Числата х, 2, 4 и 6 са записани върху две листчета. На всяко листче има по две числа. Колко са възможните числа х, ако произведението на числата от едното листче е равно на произведението на числата от другото листче?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Определете числото х, ако 8.х е число между 39 и 52, а 9.х е число също между 39 и 52?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    }55555555555

    {
        question: "Ако b@ =b.2, а @b=b.3, пресметни @2+0@+@1+5@. Пояснение: 7@ =7.2=14, @6=6.3=18.",
        image: "",
        hint: "Тази задача много прилича на (и всъщност е точно като) задачите с измислените действия, но е нестандартна. При задачите с измислените действия стратегията беше да следваме шаблона и да заместваме. Тук можем да направимм същото, но помисли как." // Leaving this empty will hide the hint button for today
    },

    
    {
        question: "Записах 6 числа едно до друго. Произведението на всеки три съседни е 12. Колко са възможните сборове на тези 6 числа?",
        image: "",
        hint: "Задачата на пръв поглед изглежда по-сложна и страшна, отколкото е. Опитай да създадеш първо една такава редица от 6 числа, каквато и да било. Забелязваш ли нещо в нея? СЪздай и втора такава редица. Какво е общото между тях? Убеди се, че то ще остане вярно във всеки случай и съответно намери и оставащите възможности." // Leaving this empty will hide the hint button for today
    },

    {
        question: "Пирати нападнали кораб и задигнали 5 куфара и 5 ключа за тях, но не било ясно кой ключ за кой куфар е предназначен. Колко проби трябва да направят в най-лошия случай, че да определят ключа за всеки куфар?",
        image: "",
        hint: "В тази задача условието за `най-лошия случай` е много подобно на това, за което сме говорили, когато намирмер имахме задачи с вадене на топки с различни цветове от чували." // Leaving this empty will hide the hint button for today
    },

    {
        question: "Един ден Николай отсъствал от училище и тогава установили, че само той отсъства и броя на момичетата са два пъти повече от момчетата. Ако учениците от този клас са по-малко от 27 и повече от 24, колко са момчетата в този клас?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "За какъв най-голям брой деца, сред 157 деца, със сигурност можем да твърдим, че са родени в един и същ месец?",
        image: "",
        hint: "Условието е малко объркващо, но ключовата дума в него е `със сигурност`. Тоест - кое е най-голямото число, което можем да кажем и да сме сигурни, че, независимо от това кога реално са родени тези 157 деца, в поне един от 12-те месеца в годината са родени поне толкова колкото сме казали деца. Перифразирам още веднъж - търсим най-голямото число x, за което изречението `В поне един от месеците в годината са родени поне x деца.` е вярно със сигурност, независимо кога са родени децата." // Leaving this empty will hide the hint button for today
    },

    {
        question: "Пресметнете A - B, ако A е най-голямото трицифрено число със сбор на цифрите 25, а В е броят на трицифрените числа със сбор на цифрите 25.",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },6666666666

    {
        question: "Съд пълен с вода тежи 9 кг, а пълен наполовина – колкото два празни съда. Колко килограма тежи този съд, когато е празен?",
        image: "",
        hint: "Рисунки тук биха помогнали, както помогнаха при другата подобна задача, която решавахме." // Leaving this empty will hide the hint button for today
    },

    {
        question: "В записа AA+B=АC, на всяка буква съответства цифра, при това на еднаквите букви съответстват еднакви цифри, а на различните букви – различни цифри. Колко са решенията на ребуса, ако двуцифреното число АА е по-малко от 40?",
        image: "",
        hint: "Както и при други ребуси, които сме решавали, ще трябва да разглеждаме различни случаи поотделно. За разлика от други ребуси, тук не е нужно да пишем всяко решение поотделно - интересува ни само бройката им." // Leaving this empty will hide the hint button for today
    },

    {
        question: "Антон и Диего имат общо 11 ябълки. Ако Диего изяде 1 от своите ябълки и даде на Антон 1 ябълка, двамата ще имат по равен брой ябълки. Колко ябълки е имал в началото Диего?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Два сини кита тежат 300 тона, а три тюлена тежат 1 тон. Колко тюлена тежат колкото 1 кит?",
        image: "",
        hint: "Внимавай какво се търси в задачата." // Leaving this empty will hide the hint button for today
    },

    {
        question: "Едно число се нарича съвършено, ако е равно на сбора на всички свои делители по-малки от това число. Числото 6 е съвършено, защото е равно на сбора 1 + 2 + 3. Следващото съвършено число е четно число, по-голямо от 24 и по-малко от 30. Кое е то?",
        image: "",
        hint: "Припомни си какво значи едно число да е делител на друго число." // Leaving this empty will hide the hint button for today
    },

    {
        question: "Точно едно от участващите в израза 6 ÷ 3 + 2 . 3 - 1 . 2 числа заменете с друго число така, че първоначалната стойност на израза да се увеличи с 1. По колко начина можем да направим тази замяна?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    }777777777777777

    {
        question: "Пет деца А, В, С, D и E чакат на опашка един зад друг, като С е между E и D. До E e А, а В не е последен. Кой е последен на опашката?",
        image: "",
        hint: "Състави си таблица с `имената` на децата и местата им в редицата, след това използвай условието и логика, за да я попълниш." // Leaving this empty will hide the hint button for today
    },

    {
        question: "Ако първият ден от годината е понеделник, определете кой ден от седмицата ще е последният ден от същата година? (Годината не е високосна.)",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Адам записал 35 числа, първото от които е 7, а всяко следващо е два пъти по-голямо от предходното. Колко от записаните числа са по-големи от 224?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Сборът на няколко числа е 10. Колко е най-голямото възможно произведение на тези събираеми?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Отсечка AB е дълга 1 км и е разделена на 100 равни части чрез точки. Те са номерирани и точката A е първата точка, а точката B е последната. Точка C се намира на еднакво разстояние от точките с номер 11 и номер 23. Колко метра е разстоянието от точка C до точка B?",
        image: "",
        hint: "Каква е дължината на всяка от 100-те равни части? А колко са точките? (Внимавай, провери интуицията си като пробваш подобна ситуация, но по-проста. Ако равните части бяха 2, а не 100, то колко щяха да са точките? Направи си чертеж. А ако бяха 3? Какво е правилото?) На какво разстояние е от началото (точка A) е точка номер 11? А 23?" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Колко е сборът на числата от 1 до 29, които могат да се представят като произведение на два равни множителя.",
        image: "",
        hint: "Тук е по-хитро да работиш наобратно - вместо да проверяваш всяко число дали може да се представи като произведение на два равни множителя, вземи два равни множителя и виж дали произведението им е сред числата от 1 до 29." // Leaving this empty will hide the hint button for today
    }8888888888888888888888
    
    {
        question: "Дадени са пет числа: 1, 2, 4, 5 и 6. Колко числа най-малко трябва да изтрием, за да мсе сигурни, че произведението на останалите може да се запише като произведение на два равни множителя?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Числата от 1 до 18 са записани едно до друго: 123456789101112131415161718. Зачеркнати са 24 цифри и се е получило най-голямото възможно число. Кое е то?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "В кошница има ябълки. Техният борой е по-малък от 30. Тези ябълки можем да разделим поравно между  2, 3 или 4 деца. Тези ябълки не можем да разделим поравно между 8 деца. Колко са ябълките в кошницата?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "В кошница има ябълки. Техният борой е по-малък от 30. Тези ябълки можем да разделим поравно между  2, 3 или 4 деца. Тези ябълки не можем да разделим поравно между 8 деца. Колко са ябълките в кошницата?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Ако делимото е 3 пъти по-голямо от делителя, а делителят е 2 пъти по-голям от частното, кое е делимото?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "В кошница има ябълки. Техният борой е по-малък от 30. Тези ябълки можем да разделим поравно между  2, 3 или 4 деца. Тези ябълки не можем да разделим поравно между 8 деца. Колко са ябълките в кошницата?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Намерете x, ако 6.x е число между 33 и 50, а 7.x е число също между 33 и 50.",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },9999999999999999999999999*/

    {
        question: "В израза 2.2+2.2+3, поставете скоби, за да се получи най-голяма стойност. Намерете тази стойност.",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Колко сантиметра е обиколката на правоъгълник, образуван от 35 еднакви квадратни плочки, всяка с обиколка 8 см, ако страните на правоъгълника са с дължина по-голяма от 2 см?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Аз живея в блок на 19 етажа. Над нашия етаж има два пъти повече етажи, отколкото под нашия етаж. На кой етаж живея аз?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Намери двуцифреното число АБ, ако (А+Б).11-АБ=31.",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Пресметни израза (1.2.3.4) : (1.2.3) + (1.3.5.7) : (1.3.5) + (1.4.7.10) : (1.4.7).",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Валя разделила няколко еднакви ябълки поравно между себе си и 11 свои приятелки. Всяка получила по половин ябълка. Колко са ябълките?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    },

    {
        question: "Колко сантиметра е обиколката на правоъгълник, ако сборът на двете негови по-големи страни и едната по-малка е 17 см, а сборът на двете негови по-малки страни и едната по-голяма е 16 см?",
        image: "",
        hint: "" // Leaving this empty will hide the hint button for today
    }


];
